Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/criminal_law/spent_convictions.html.txt.tmx
Source language: en
Languages: ga

source: Once a person with a criminal conviction has paid their debt to society, it is very much in society’s interest and that of the offender that they be reintegrated into society as quickly as possible
ga: A luaithe a mhaitheann duine ag a bhfuil ciontú coiriúil a bhfiacha don tsochaí, téann sé chun mórshochair na sochaí agus an chiontóra go ndéantar iad a ath-chomhtháthú isteach sa tsochaí a thapúla agus is féidir

source: However, disclosure of a criminal conviction is likely to have a negative effect on the person’s employment prospects and can also affect a person’s life in numerous other ways:
ga: Is dóchúil, áfach, go n-imreoidh nochtadh ciontaithe choiriúil tionchar diúltach ar ionchais fostaíochta duine agus féadfaidh sé tionchar a imirt ar shaol duine ar roinnt mhaith bealaí eile, chomh maith:

source: • Entry to certain professions such as law or medicine is denied
ga: • Diúltaítear iontráil isteach i ngairmeacha áirithe, ar nós an dlí nó leighis

source: • A licence such as PSV (public service vehicle) driver’s licence or a firearms licence is refused
ga: • Diúltaítear ceadúnas ar nós ceadúnas tiomána FSP (feithicil seirbhíse poiblí) nó ceadúnas arm tine

source: • Insurance cover may be declined
ga: • Féadtar cumhdach árachais a dhiúltú

source: The consequences may be even more serious where the person fails to disclose the conviction but its existence emerges at a later date
ga: D’fhéadfadh na hiarmhairtí a bheith fiú níos tromchúisí sa chás go dteipeann ar an duine an ciontú a nochtadh ach go dtagann a láithreacht chun solais ag dáta níos déanaí

source: Under Section 258 of the Children Act 2001 an offence committed by a child can be automatically removed from the record as if never committed, once certain conditions are met
ga: Faoi Alt 258 d’Acht na Leanaí, 2001, féadtar cion a rinne leanbh a bhaint go huathoibríoch ón taifead amhail is nach ndearnadh riamh é, a luaithe a chomhlíontar coinníollacha áirithe

source: You can find more information in our document on children and the criminal justice system
ga: Féadfaidh tú teacht ar bhreis faisnéise inár gcáipéis ar leanaí agus an córas ceartais choiriúil

source: Under the Criminal Justice (Spent Convictions and Certain Disclosures) Act 2016, which came into effect on 29 April 2016, a range of minor offences will become spent after 7 years
ga: Faoin Acht um Cheartas Coiriúil (Ciontuithe Spíonta agus Nochtadh Áirithe), 2016, a tháinig i bhfeidhm an 29 Aibreán 2016, beidh réimse mionchionta spíonta i ndiaidh 7 mbliana

source: This means that an adult convicted of an offence covered by the Act does not have to disclose the conviction after 7 years, except in certain circumstances
ga: Ciallaíonn seo nach gá do dhuine fásta atá ciontaithe i leith ciona a cumhdaíonn an tAcht an ciontú a nochtadh i ndiaidh 7 mbliana, seachas faoi chúinsí airithe

source: The convictions which may be regarded as spent after 7 years are set out in Section 5 of the Act
ga: Leagtar amach na cionta ar féidir a mheas go bhfuil siad spíonta i ndiaidh 7 mbliana in Alt 5 den Acht

source: • All convictions in the District Court for motoring offences except for convictions for dangerous driving which are limited to a single conviction
ga: • Gach ciontú sa Chúirt Dúiche i ngeall ar chionta tiomána, seachas i dtaobh ciontuithe i ngeall ar thiomáint chontúirteach atá teoranta do chiontú aonair

source: • All convictions in the District Court for minor public order offences
ga: • Gach ciontú sa Chúirt Dúiche i ngeall ar mhionchionta oird phoiblí

source: • A single conviction (other than a motoring or public order offence) in the District or Circuit Court which resulted in a term of imprisonment of 12 months or less (or a fine)
ga: • Ciontú aonair (seachas cion tiomána nó oird phoiblí) sa Chúirt Dúiche nó sa Chúirt Chuarda ónar eascair téarma príosúnachta 12 mhí nó níos lú (nó fíneáil)

source: The Act does not apply to any conviction for a sexual offence or an offence which was tried in the Central Criminal Court
ga: Ní bhaineann an tAcht le haon chiontú i ngeall ar chion gnéasach nó cion a rinneadh a thriail sa Phríomh-Chúirt Choiriúil

source: The 7 years is from the date the custodial or non-custodial sentence became operative and you must have complied with the sentence or order imposed
ga: Bíonn an tréimhse 7 mbliana i gceist ón dáta a bhí an phianbhreith choinneála nó neamhchoinneála oibríoch agus ní mór gur chomhlíon tú an phianbhreith nó an t-ordú a gearradh

source: In general, you are not required to disclose a spent conviction when supplying information on past convictions
ga: Go ginearálta, níl ort ciontú spíonta a nochtadh nuair a sholáthraíonn tú faisnéis ar chiontuithe roimhe seo

source: However, you may be required to disclose a spent conviction in court proceedings and the circumstances are set out in Section 7 of the Act
ga: B’fhéidir go mbeidh ort ciontú spíonta a nochtadh, áfach, in imeachtaí cúirte agus leagtar amach na cúinsí in Alt 7 den Acht

source: You must also disclose any spent convictions:
ga: Ní mór duit aon chiontuithe spíonta a nochtadh chomh maith:

source: • In a Garda interview following your arrest in connection with the investigation of an offence
ga: • In agallamh leis an nGarda Síochána i ndiaidh gur gabhadh thú maidir le himscrúdú ciona

source: - to enter, be or remain in the State
ga: - chun an Stát a iontráil, nó fanacht sa Stát

source: • In an application or during an investigation under Part 3 of the Central Bank Reform Act 2010
ga: • In iarratas nó i rith imscrúdú faoi Chuid 3 den Acht um Athchóiriú an Bhainc Cheannais, 2010

source: If you have been convicted of fraud, deceit or dishonesty in respect of a claim under a policy of insurance or a policy of assurance, you have to disclose that conviction on any insurance or assurance proposal or form
ga: Má ciontaíodh thú i leith calaoise, meabhail nó caimiléireachta maidir le héileamh faoi pholasaí árachais nó polasaí ráthaíochta, tá ort an ciontú sin a nochtadh ar aon togra nó foirm árachais nó ráthaíochta

source: Disclosure is required if you are applying for certain types of licence
ga: Teastaíonn nochtadh má bhíonn iarratas á dhéanamh agat ar shaghsanna áirithe de cheadúnas

source: These licences include public service vehicle, private security, taxi and firearms licences
ga: I measc na gceadúnas seo, tá ceadúnais feithicil seirbhíse poiblí, slándála príobháidí, tacsaí agus airm thine

source: In general, you are not required to disclose a spent conviction when looking for employment
ga: Go ginearálta, níl ort ciontú spíonta a nochtadh nuair a bhíonn fostaíocht á cuardach agat

source: However, you have to disclose any spent convictions if you are applying to work for certain bodies, such as, the Garda Síochána, the Courts Service and some government departments
ga: Tá ort aon chiontuithe spíonta a nochtadh má bhíonn iarratas á dhéanamh agat ar obair ó roinnt comhlachtaí, ar nós an Gharda Síochána, na Seirbhís Cúirteanna agus roinnt ranna rialtais, áfach

source: The list of bodies is given in Schedule 2 of the Act
ga: Tugtar an liosta comhlachtaí i Sceideal 2 den Acht

source: The non-disclosure regime under the Criminal Justice (Spent Convictions and Certain Disclosures) Act 2016 does not apply to employment relating to children or vulnerable adults
ga: Ní bhaineann an córas neamhnochta faoin Acht um Cheartas Coiriúil (Ciontuithe Spíonta agus Nochtadh Áirithe), 2016 le fostaíocht a bhaineann le leanaí nó le daoine fásta leochaileacha

source: Such applicants must be Garda vetted and Garda vetting has its own non-disclosure regime
ga: Ní mór grinnfhiosrúchán an Gharda Síochána a dhéanamh ar na hiarratasóirí siúd agus tá a chóras féin neamhnochta ag Grinnfhiosrúchán an Gharda Síochána

source: Disclosure in other states
ga: Nochtadh i stáit eile

source: The Irish spent convictions legislation cannot be used to prevent disclosure when you are required to disclose information about your criminal convictions to another state, for example, the USA or Australia
ga: Ní féidir reachtaíocht um chiontuithe spíonta na hÉireann a úsáid chun cosc a chur ar nochtadh nuair a bhíonn ort faisnéis a nochtadh faoi do chiontuithe coiriúla do stát eile, mar shampla, SAM nó an Astráil

source: You are subject to that country’s laws and may have to disclose such convictions
ga: Bíonn tú faoi réir dhlíthe na tíre sin agus b’fhéidir go mbeidh ort na ciontuithe siúd a nochtadh

source: Accessing criminal records held by the Gardaí
ga: Measúnú a dhéanamh ar thaifid choiriúla atá á gcoimeád ag na Gardaí

source: Under the Data Protection Act 1988 you have the right to access personal data about you that is held by the Garda Síochána
ga: Faoin Acht um Chosaint Sonraí, 1988, bronntar an ceart ort chun rochtain a fháil ar shonraí pearsanta fút atá á gcoimeád ag an nGarda Síochána

source: If you request a copy of your criminal record from the Garda Síochána, the record will be provided in 2 parts, with the spent convictions provided separately from the other convictions (if any)
ga: Má iarrann tú ar chóip de do thaifead coiriúil ón nGarda Síochána, soláthrófar an taifead in 2 chuid, agus soláthrófar na ciontuithe spíonta ar leithligh ó na ciontuithe eile (más ann dóibh)

source: This means that you will be able to provide a clean record if your convictions are spent
ga: Ciallaíonn seo go mbeidh tú in ann taifead glan a sholáthar má tá do chiontuithe spíonta
